class Solution {
    public int maxArea(int[] height) {
        int l = 0,r = height.length-1;
        int mxArea = 0;
        while(l<r){
            int width = 0;
            int area = 0;
            width = r-l;
            area = width*Math.min(height[l],height[r]);
            
            mxArea = Math.max(mxArea,area);
            if(height[l]<height[r]) l++;
            else if(height[l]>height[r]) r--;
            else l++; //in equality case
        }
        return mxArea;
    }
}
// طالما شغالة متلمسهاش
/*
██████╗ ██████╗  █████╗ ██╗  ██╗███████╗███╗   ██╗
██╔══██╗██╔══██╗██╔══██╗██║ ██╔╝██╔════╝████╗  ██║
██║  ██║██████╔╝███████║█████╔╝ █████╗  ██╔██╗ ██║
██║  ██║██╔══██╗██╔══██║██╔═██╗ ██╔══╝  ██║╚██╗██║
██████╔╝██║  ██║██║  ██║██║  ██╗███████╗██║ ╚████║
╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝
*/
