class Solution {
    public String intToRoman(int num) {
        int[] ronum = {1000,900,500,400,100,90,50,40,10,9,5,4,1};
        String[] romans = {"M","CM","D","CD","C","XC","L","XL","X","IX","V","IV","I"};
        StringBuilder elpolpol = new StringBuilder();
        for(int i=0;i<ronum.length;i++){
            while(num>=ronum[i]){
                elpolpol.append(romans[i]);
                num-=ronum[i];
            }
        }
        return elpolpol.toString();
    }
}
/*
██████╗ ██████╗  █████╗ ██╗  ██╗███████╗███╗   ██╗
██╔══██╗██╔══██╗██╔══██╗██║ ██╔╝██╔════╝████╗  ██║
██║  ██║██████╔╝███████║█████╔╝ █████╗  ██╔██╗ ██║
██║  ██║██╔══██╗██╔══██║██╔═██╗ ██╔══╝  ██║╚██╗██║
██████╔╝██║  ██║██║  ██║██║  ██╗███████╗██║ ╚████║
╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝
*/
