class Solution {
    public List<List<Integer>> threeSum(int[] nums) {
        Arrays.sort(nums);
        List<List<Integer>> theBom = new ArrayList<>();
        for(int i=0;i<nums.length-2;i++){
            if (i > 0 && nums[i] == nums[i - 1])
                continue;
            int l =i+1,r = nums.length-1;
            int sum = 0;
            while(l<r){
                sum = nums[l]+nums[r]+nums[i];
                if(sum>0) r--;
                else if(sum<0) l++;
                else { 
                    List<Integer> triplet = Arrays.asList(nums[i],nums[l],nums[r]);
                    theBom.add(triplet); 
                        l++;
                        r--;
                    while(l<r&&nums[l]==nums[l-1]) l++;
                    while(l<r&&nums[r]==nums[r+1]) r--;
                }
            }
        }
        return theBom;
    }
}

/*
██████╗ ██████╗  █████╗ ██╗  ██╗███████╗███╗   ██╗
██╔══██╗██╔══██╗██╔══██╗██║ ██╔╝██╔════╝████╗  ██║
██║  ██║██████╔╝███████║█████╔╝ █████╗  ██╔██╗ ██║
██║  ██║██╔══██╗██╔══██║██╔═██╗ ██╔══╝  ██║╚██╗██║
██████╔╝██║  ██║██║  ██║██║  ██╗███████╗██║ ╚████║
╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝
*/




